# 数据类型字典

# 定义字典

# 字典的类型
# 字典的格式是键值对，键（key），值（value）对

# 键与值要用： 隔开 之间的内容用，隔开

# di = {
#     "name": 3.5,
#     "age": 100,
# }
# print(di)
#
# d100 = {
#
#     "k1": {
#         "k1.1": 10,
#         "k1.2": 20
#     },
#     "k2": [
#         1,
#         2,
#         3,
#         "rseyhrryrd",
#         False,
#         {
#             "k2.2": 12,
#             "k2.3": 12,
#             "k1.2": 12,
#             "k1.3": 13,
#             "1.1": (12, 16, 18, "13", {
#                 "k3.8": 38,
#                 "12": 21
#             }),
#             # "1.1": 1# 不会报错，但会覆盖
#
#         }
#     ]
# }
#
# for k, v in d100.items():
#     print(k,v)


d = {
    "a": 1

}
for i in d.items():
    print(i, type(i))



